# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
# tap "homebrew/headonly"
tap "joeyhoer/extras"

# Cask dependencies
brew "mas"
cask "java"
cask "xquartz"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "bash-completion"
brew "zsh"
brew "antigen"

# CLI utilities
# Note: This replaces some (outdated) built-in macOS utilities with the GNU equivalents
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "curl", args: ["with-nghttp2"]
#brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "git"
brew "gnupg" 
#brew "gnu-sed", args: ["default-names"] # Install GNU `sed`, overwriting the built-in `sed`
brew "grep"
brew "httpie"
brew "jq"
brew "mmv"
brew "mosh"
#brew "moreutils" # Install more useful GNU utilities like `sponge`
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "wget"

# Mac OS tools
brew "duti" # Required for setting preferences
brew "mackup"
brew "tccutil" # Required for setting preferences
brew "trash"
brew "wifi-password"

# Programming languages
# Installing Python/Ruby with Homebrew is unnecessary,
# as they will be installed and managed via pyenv/rbenv respectively
brew "go"
brew "ruby" # Ruby
brew "ruby-completion"
brew "node-build"
brew "nvm" 


# Docker
brew "docker-machine-driver-hyperkit"
brew "docker-machine"
brew "docker-machine-completion"
brew "docker-machine-nfs"
brew "docker-ls"
brew "docker-compose"
brew "docker"
brew "docker-completion"

# Install GUI applications
cask "adobe-creative-cloud"
cask "amazon-music"
cask "android-file-transfer"
cask "bettertouchtool"
cask "bartender"
cask "caffeine"
cask "calibre"
cask "code42-crashplan"
cask "disk-inventory-x"
cask "fork"
cask "gitup"
cask "iina"
cask "iterm2"
cask "itsycal"
cask "kap-beta"
cask "keybase"
cask "mattermost"
cask "mounty"
cask "nextcloud"
cask "osxfuse"
cask "rambox"
cask "rocket"
cask "sidekick"
cask "signal"
cask "skype"
cask "standard-notes"
cask "sublime-text"
cask "transmission"
cask "transmission-remote-gui"
cask "transmit4"
cask "tresorit"
cask "vlc"
cask "zoomus"

# Browsers
cask "safari-technology-preview"
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefox-developer-edition"

# QuickLook plugins
cask "webpquicklook"
cask "suspicious-package"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklook-csv"

# Color Picker plugins
cask "colorpicker-skalacolor"

# Fonts
cask "font-anonymous-pro"
cask "font-bebas-neue"
cask "font-comic-neue"
cask "font-dejavu-sans"
cask "font-league-gothic"
cask "font-liberation-sans"
cask "joeyhoer/extras/font-microsoft-office"
cask "joeyhoer/extras/font-san-francisco-compact"
cask "font-symbola"
cask "font-fira-code"
cask "font-source-code-pro"
cask "sky-fonts"

# MAS applications
# Get a list of installed MAS apps with:
# `brew bundle dump --file=- | egrep ^mas`

# mas "Airmail", id: 918858936
mas "Bitwarden", id: 1352778147
mas "Mactracker", id: 430255202
mas "Pocket", id: 568494494
mas "Telegram", id: 747648890
mas "Trello", id: 1278508951
mas "Wire", id: 931134707

# Apple MAS applications
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
